zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/k6x/pinctrl/MK64FX512VLQ12-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MK64FX512VLQ12/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _ZEPHYR_DTS_BINDING_MK64FX512VLQ12_
#define _ZEPHYR_DTS_BINDING_MK64FX512VLQ12_

#define KINETIS_MUX(port, pin, mux)		\
	(((((port) - 'A') & 0xF) << 28) |	\
	(((pin) & 0x3F) << 22) |		\
	(((mux) & 0x7) << 8))

#define PTA0 KINETIS_MUX('A',0,1) /* PTA_0 */
#define UART0_COL_b_PTA0 KINETIS_MUX('A',0,2) /* PTA_0 */
#define UART0_CTS_b_PTA0 KINETIS_MUX('A',0,2) /* PTA_0 */
#define FTM0_CH5_PTA0 KINETIS_MUX('A',0,3) /* PTA_0 */
#define JTAG_TCLK_PTA0 KINETIS_MUX('A',0,7) /* PTA_0 */
#define PTA1 KINETIS_MUX('A',1,1) /* PTA_1 */
#define UART0_RX_PTA1 KINETIS_MUX('A',1,2) /* PTA_1 */
#define FTM0_CH6_PTA1 KINETIS_MUX('A',1,3) /* PTA_1 */
#define JTAG_TDI_PTA1 KINETIS_MUX('A',1,7) /* PTA_1 */
#define PTA2 KINETIS_MUX('A',2,1) /* PTA_2 */
#define UART0_TX_PTA2 KINETIS_MUX('A',2,2) /* PTA_2 */
#define FTM0_CH7_PTA2 KINETIS_MUX('A',2,3) /* PTA_2 */
#define JTAG_TDO_PTA2 KINETIS_MUX('A',2,7) /* PTA_2 */
#define TRACE_SWO_PTA2 KINETIS_MUX('A',2,7) /* PTA_2 */
#define PTA3 KINETIS_MUX('A',3,1) /* PTA_3 */
#define UART0_RTS_b_PTA3 KINETIS_MUX('A',3,2) /* PTA_3 */
#define FTM0_CH0_PTA3 KINETIS_MUX('A',3,3) /* PTA_3 */
#define JTAG_TMS_PTA3 KINETIS_MUX('A',3,7) /* PTA_3 */
#define PTA4 KINETIS_MUX('A',4,1) /* PTA_4 */
#define LLWU_P3_PTA4 KINETIS_MUX('A',4,1) /* PTA_4 */
#define FTM0_CH1_PTA4 KINETIS_MUX('A',4,3) /* PTA_4 */
#define NMI_b_PTA4 KINETIS_MUX('A',4,7) /* PTA_4 */
#define PTA5 KINETIS_MUX('A',5,1) /* PTA_5 */
#define USB_CLKIN_PTA5 KINETIS_MUX('A',5,2) /* PTA_5 */
#define FTM0_CH2_PTA5 KINETIS_MUX('A',5,3) /* PTA_5 */
#define RMII0_RXER_PTA5 KINETIS_MUX('A',5,4) /* PTA_5 */
#define MII0_RXER_PTA5 KINETIS_MUX('A',5,4) /* PTA_5 */
#define CMP2_OUT_PTA5 KINETIS_MUX('A',5,5) /* PTA_5 */
#define I2S0_TX_BCLK_PTA5 KINETIS_MUX('A',5,6) /* PTA_5 */
#define JTAG_TRST_b_PTA5 KINETIS_MUX('A',5,7) /* PTA_5 */
#define PTA6 KINETIS_MUX('A',6,1) /* PTA_6 */
#define FTM0_CH3_PTA6 KINETIS_MUX('A',6,3) /* PTA_6 */
#define CLKOUT_PTA6 KINETIS_MUX('A',6,5) /* PTA_6 */
#define TRACE_CLKOUT_PTA6 KINETIS_MUX('A',6,7) /* PTA_6 */
#define ADC0_SE10_PTA7 KINETIS_MUX('A',7,0) /* PTA_7 */
#define PTA7 KINETIS_MUX('A',7,1) /* PTA_7 */
#define FTM0_CH4_PTA7 KINETIS_MUX('A',7,3) /* PTA_7 */
#define TRACE_D3_PTA7 KINETIS_MUX('A',7,7) /* PTA_7 */
#define ADC0_SE11_PTA8 KINETIS_MUX('A',8,0) /* PTA_8 */
#define PTA8 KINETIS_MUX('A',8,1) /* PTA_8 */
#define FTM1_CH0_PTA8 KINETIS_MUX('A',8,3) /* PTA_8 */
#define FTM1_QD_PHA_PTA8 KINETIS_MUX('A',8,6) /* PTA_8 */
#define TRACE_D2_PTA8 KINETIS_MUX('A',8,7) /* PTA_8 */
#define PTA9 KINETIS_MUX('A',9,1) /* PTA_9 */
#define FTM1_CH1_PTA9 KINETIS_MUX('A',9,3) /* PTA_9 */
#define MII0_RXD3_PTA9 KINETIS_MUX('A',9,4) /* PTA_9 */
#define FTM1_QD_PHB_PTA9 KINETIS_MUX('A',9,6) /* PTA_9 */
#define TRACE_D1_PTA9 KINETIS_MUX('A',9,7) /* PTA_9 */
#define PTA10 KINETIS_MUX('A',10,1) /* PTA_10 */
#define FTM2_CH0_PTA10 KINETIS_MUX('A',10,3) /* PTA_10 */
#define MII0_RXD2_PTA10 KINETIS_MUX('A',10,4) /* PTA_10 */
#define FTM2_QD_PHA_PTA10 KINETIS_MUX('A',10,6) /* PTA_10 */
#define TRACE_D0_PTA10 KINETIS_MUX('A',10,7) /* PTA_10 */
#define PTA11 KINETIS_MUX('A',11,1) /* PTA_11 */
#define FTM2_CH1_PTA11 KINETIS_MUX('A',11,3) /* PTA_11 */
#define MII0_RXCLK_PTA11 KINETIS_MUX('A',11,4) /* PTA_11 */
#define I2C2_SDA_PTA11 KINETIS_MUX('A',11,5) /* PTA_11 */
#define FTM2_QD_PHB_PTA11 KINETIS_MUX('A',11,6) /* PTA_11 */
#define CMP2_IN0_PTA12 KINETIS_MUX('A',12,0) /* PTA_12 */
#define PTA12 KINETIS_MUX('A',12,1) /* PTA_12 */
#define CAN0_TX_PTA12 KINETIS_MUX('A',12,2) /* PTA_12 */
#define FTM1_CH0_PTA12 KINETIS_MUX('A',12,3) /* PTA_12 */
#define RMII0_RXD1_PTA12 KINETIS_MUX('A',12,4) /* PTA_12 */
#define MII0_RXD1_PTA12 KINETIS_MUX('A',12,4) /* PTA_12 */
#define I2C2_SCL_PTA12 KINETIS_MUX('A',12,5) /* PTA_12 */
#define I2S0_TXD0_PTA12 KINETIS_MUX('A',12,6) /* PTA_12 */
#define FTM1_QD_PHA_PTA12 KINETIS_MUX('A',12,7) /* PTA_12 */
#define CMP2_IN1_PTA13 KINETIS_MUX('A',13,0) /* PTA_13 */
#define LLWU_P4_PTA13 KINETIS_MUX('A',13,1) /* PTA_13 */
#define PTA13 KINETIS_MUX('A',13,1) /* PTA_13 */
#define CAN0_RX_PTA13 KINETIS_MUX('A',13,2) /* PTA_13 */
#define FTM1_CH1_PTA13 KINETIS_MUX('A',13,3) /* PTA_13 */
#define MII0_RXD0_PTA13 KINETIS_MUX('A',13,4) /* PTA_13 */
#define RMII0_RXD0_PTA13 KINETIS_MUX('A',13,4) /* PTA_13 */
#define I2C2_SDA_PTA13 KINETIS_MUX('A',13,5) /* PTA_13 */
#define I2S0_TX_FS_PTA13 KINETIS_MUX('A',13,6) /* PTA_13 */
#define FTM1_QD_PHB_PTA13 KINETIS_MUX('A',13,7) /* PTA_13 */
#define PTA14 KINETIS_MUX('A',14,1) /* PTA_14 */
#define SPI0_PCS0_PTA14 KINETIS_MUX('A',14,2) /* PTA_14 */
#define UART0_TX_PTA14 KINETIS_MUX('A',14,3) /* PTA_14 */
#define MII0_RXDV_PTA14 KINETIS_MUX('A',14,4) /* PTA_14 */
#define RMII0_CRS_DV_PTA14 KINETIS_MUX('A',14,4) /* PTA_14 */
#define I2C2_SCL_PTA14 KINETIS_MUX('A',14,5) /* PTA_14 */
#define I2S0_RX_BCLK_PTA14 KINETIS_MUX('A',14,6) /* PTA_14 */
#define I2S0_TXD1_PTA14 KINETIS_MUX('A',14,7) /* PTA_14 */
#define PTA15 KINETIS_MUX('A',15,1) /* PTA_15 */
#define SPI0_SCK_PTA15 KINETIS_MUX('A',15,2) /* PTA_15 */
#define UART0_RX_PTA15 KINETIS_MUX('A',15,3) /* PTA_15 */
#define RMII0_TXEN_PTA15 KINETIS_MUX('A',15,4) /* PTA_15 */
#define MII0_TXEN_PTA15 KINETIS_MUX('A',15,4) /* PTA_15 */
#define I2S0_RXD0_PTA15 KINETIS_MUX('A',15,6) /* PTA_15 */
#define PTA16 KINETIS_MUX('A',16,1) /* PTA_16 */
#define SPI0_SOUT_PTA16 KINETIS_MUX('A',16,2) /* PTA_16 */
#define UART0_CTS_b_PTA16 KINETIS_MUX('A',16,3) /* PTA_16 */
#define UART0_COL_b_PTA16 KINETIS_MUX('A',16,3) /* PTA_16 */
#define MII0_TXD0_PTA16 KINETIS_MUX('A',16,4) /* PTA_16 */
#define RMII0_TXD0_PTA16 KINETIS_MUX('A',16,4) /* PTA_16 */
#define I2S0_RX_FS_PTA16 KINETIS_MUX('A',16,6) /* PTA_16 */
#define I2S0_RXD1_PTA16 KINETIS_MUX('A',16,7) /* PTA_16 */
#define ADC1_SE17_PTA17 KINETIS_MUX('A',17,0) /* PTA_17 */
#define PTA17 KINETIS_MUX('A',17,1) /* PTA_17 */
#define SPI0_SIN_PTA17 KINETIS_MUX('A',17,2) /* PTA_17 */
#define UART0_RTS_b_PTA17 KINETIS_MUX('A',17,3) /* PTA_17 */
#define RMII0_TXD1_PTA17 KINETIS_MUX('A',17,4) /* PTA_17 */
#define MII0_TXD1_PTA17 KINETIS_MUX('A',17,4) /* PTA_17 */
#define I2S0_MCLK_PTA17 KINETIS_MUX('A',17,6) /* PTA_17 */
#define EXTAL0_PTA18 KINETIS_MUX('A',18,0) /* PTA_18 */
#define PTA18 KINETIS_MUX('A',18,1) /* PTA_18 */
#define FTM0_FLT2_PTA18 KINETIS_MUX('A',18,3) /* PTA_18 */
#define FTM_CLKIN0_PTA18 KINETIS_MUX('A',18,4) /* PTA_18 */
#define XTAL0_PTA19 KINETIS_MUX('A',19,0) /* PTA_19 */
#define PTA19 KINETIS_MUX('A',19,1) /* PTA_19 */
#define FTM1_FLT0_PTA19 KINETIS_MUX('A',19,3) /* PTA_19 */
#define FTM_CLKIN1_PTA19 KINETIS_MUX('A',19,4) /* PTA_19 */
#define LPTMR0_ALT1_PTA19 KINETIS_MUX('A',19,6) /* PTA_19 */
#define PTA24 KINETIS_MUX('A',24,1) /* PTA_24 */
#define MII0_TXD2_PTA24 KINETIS_MUX('A',24,4) /* PTA_24 */
#define PTA25 KINETIS_MUX('A',25,1) /* PTA_25 */
#define MII0_TXCLK_PTA25 KINETIS_MUX('A',25,4) /* PTA_25 */
#define PTA26 KINETIS_MUX('A',26,1) /* PTA_26 */
#define MII0_TXD3_PTA26 KINETIS_MUX('A',26,4) /* PTA_26 */
#define PTA27 KINETIS_MUX('A',27,1) /* PTA_27 */
#define MII0_CRS_PTA27 KINETIS_MUX('A',27,4) /* PTA_27 */
#define PTA28 KINETIS_MUX('A',28,1) /* PTA_28 */
#define MII0_TXER_PTA28 KINETIS_MUX('A',28,4) /* PTA_28 */
#define PTA29 KINETIS_MUX('A',29,1) /* PTA_29 */
#define MII0_COL_PTA29 KINETIS_MUX('A',29,4) /* PTA_29 */
#define ADC0_SE8_PTB0 KINETIS_MUX('B',0,0) /* PTB_0 */
#define ADC1_SE8_PTB0 KINETIS_MUX('B',0,0) /* PTB_0 */
#define PTB0 KINETIS_MUX('B',0,1) /* PTB_0 */
#define LLWU_P5_PTB0 KINETIS_MUX('B',0,1) /* PTB_0 */
#define I2C0_SCL_PTB0 KINETIS_MUX('B',0,2) /* PTB_0 */
#define FTM1_CH0_PTB0 KINETIS_MUX('B',0,3) /* PTB_0 */
#define MII0_MDIO_PTB0 KINETIS_MUX('B',0,4) /* PTB_0 */
#define RMII0_MDIO_PTB0 KINETIS_MUX('B',0,4) /* PTB_0 */
#define FTM1_QD_PHA_PTB0 KINETIS_MUX('B',0,6) /* PTB_0 */
#define ADC0_SE9_PTB1 KINETIS_MUX('B',1,0) /* PTB_1 */
#define ADC1_SE9_PTB1 KINETIS_MUX('B',1,0) /* PTB_1 */
#define PTB1 KINETIS_MUX('B',1,1) /* PTB_1 */
#define I2C0_SDA_PTB1 KINETIS_MUX('B',1,2) /* PTB_1 */
#define FTM1_CH1_PTB1 KINETIS_MUX('B',1,3) /* PTB_1 */
#define RMII0_MDC_PTB1 KINETIS_MUX('B',1,4) /* PTB_1 */
#define MII0_MDC_PTB1 KINETIS_MUX('B',1,4) /* PTB_1 */
#define FTM1_QD_PHB_PTB1 KINETIS_MUX('B',1,6) /* PTB_1 */
#define ADC0_SE12_PTB2 KINETIS_MUX('B',2,0) /* PTB_2 */
#define PTB2 KINETIS_MUX('B',2,1) /* PTB_2 */
#define I2C0_SCL_PTB2 KINETIS_MUX('B',2,2) /* PTB_2 */
#define UART0_RTS_b_PTB2 KINETIS_MUX('B',2,3) /* PTB_2 */
#define ENET0_1588_TMR0_PTB2 KINETIS_MUX('B',2,4) /* PTB_2 */
#define FTM0_FLT3_PTB2 KINETIS_MUX('B',2,6) /* PTB_2 */
#define ADC0_SE13_PTB3 KINETIS_MUX('B',3,0) /* PTB_3 */
#define PTB3 KINETIS_MUX('B',3,1) /* PTB_3 */
#define I2C0_SDA_PTB3 KINETIS_MUX('B',3,2) /* PTB_3 */
#define UART0_CTS_b_PTB3 KINETIS_MUX('B',3,3) /* PTB_3 */
#define UART0_COL_b_PTB3 KINETIS_MUX('B',3,3) /* PTB_3 */
#define ENET0_1588_TMR1_PTB3 KINETIS_MUX('B',3,4) /* PTB_3 */
#define FTM0_FLT0_PTB3 KINETIS_MUX('B',3,6) /* PTB_3 */
#define ADC1_SE10_PTB4 KINETIS_MUX('B',4,0) /* PTB_4 */
#define PTB4 KINETIS_MUX('B',4,1) /* PTB_4 */
#define ENET0_1588_TMR2_PTB4 KINETIS_MUX('B',4,4) /* PTB_4 */
#define FTM1_FLT0_PTB4 KINETIS_MUX('B',4,6) /* PTB_4 */
#define ADC1_SE11_PTB5 KINETIS_MUX('B',5,0) /* PTB_5 */
#define PTB5 KINETIS_MUX('B',5,1) /* PTB_5 */
#define ENET0_1588_TMR3_PTB5 KINETIS_MUX('B',5,4) /* PTB_5 */
#define FTM2_FLT0_PTB5 KINETIS_MUX('B',5,6) /* PTB_5 */
#define ADC1_SE12_PTB6 KINETIS_MUX('B',6,0) /* PTB_6 */
#define PTB6 KINETIS_MUX('B',6,1) /* PTB_6 */
#define ADC1_SE13_PTB7 KINETIS_MUX('B',7,0) /* PTB_7 */
#define PTB7 KINETIS_MUX('B',7,1) /* PTB_7 */
#define PTB8 KINETIS_MUX('B',8,1) /* PTB_8 */
#define UART3_RTS_b_PTB8 KINETIS_MUX('B',8,3) /* PTB_8 */
#define PTB9 KINETIS_MUX('B',9,1) /* PTB_9 */
#define SPI1_PCS1_PTB9 KINETIS_MUX('B',9,2) /* PTB_9 */
#define UART3_CTS_b_PTB9 KINETIS_MUX('B',9,3) /* PTB_9 */
#define ADC1_SE14_PTB10 KINETIS_MUX('B',10,0) /* PTB_10 */
#define PTB10 KINETIS_MUX('B',10,1) /* PTB_10 */
#define SPI1_PCS0_PTB10 KINETIS_MUX('B',10,2) /* PTB_10 */
#define UART3_RX_PTB10 KINETIS_MUX('B',10,3) /* PTB_10 */
#define FTM0_FLT1_PTB10 KINETIS_MUX('B',10,6) /* PTB_10 */
#define ADC1_SE15_PTB11 KINETIS_MUX('B',11,0) /* PTB_11 */
#define PTB11 KINETIS_MUX('B',11,1) /* PTB_11 */
#define SPI1_SCK_PTB11 KINETIS_MUX('B',11,2) /* PTB_11 */
#define UART3_TX_PTB11 KINETIS_MUX('B',11,3) /* PTB_11 */
#define FTM0_FLT2_PTB11 KINETIS_MUX('B',11,6) /* PTB_11 */
#define PTB16 KINETIS_MUX('B',16,1) /* PTB_16 */
#define SPI1_SOUT_PTB16 KINETIS_MUX('B',16,2) /* PTB_16 */
#define UART0_RX_PTB16 KINETIS_MUX('B',16,3) /* PTB_16 */
#define FTM_CLKIN0_PTB16 KINETIS_MUX('B',16,4) /* PTB_16 */
#define EWM_IN_PTB16 KINETIS_MUX('B',16,6) /* PTB_16 */
#define PTB17 KINETIS_MUX('B',17,1) /* PTB_17 */
#define SPI1_SIN_PTB17 KINETIS_MUX('B',17,2) /* PTB_17 */
#define UART0_TX_PTB17 KINETIS_MUX('B',17,3) /* PTB_17 */
#define FTM_CLKIN1_PTB17 KINETIS_MUX('B',17,4) /* PTB_17 */
#define EWM_OUT_b_PTB17 KINETIS_MUX('B',17,6) /* PTB_17 */
#define PTB18 KINETIS_MUX('B',18,1) /* PTB_18 */
#define CAN0_TX_PTB18 KINETIS_MUX('B',18,2) /* PTB_18 */
#define FTM2_CH0_PTB18 KINETIS_MUX('B',18,3) /* PTB_18 */
#define I2S0_TX_BCLK_PTB18 KINETIS_MUX('B',18,4) /* PTB_18 */
#define FTM2_QD_PHA_PTB18 KINETIS_MUX('B',18,6) /* PTB_18 */
#define PTB19 KINETIS_MUX('B',19,1) /* PTB_19 */
#define CAN0_RX_PTB19 KINETIS_MUX('B',19,2) /* PTB_19 */
#define FTM2_CH1_PTB19 KINETIS_MUX('B',19,3) /* PTB_19 */
#define I2S0_TX_FS_PTB19 KINETIS_MUX('B',19,4) /* PTB_19 */
#define FTM2_QD_PHB_PTB19 KINETIS_MUX('B',19,6) /* PTB_19 */
#define PTB20 KINETIS_MUX('B',20,1) /* PTB_20 */
#define SPI2_PCS0_PTB20 KINETIS_MUX('B',20,2) /* PTB_20 */
#define CMP0_OUT_PTB20 KINETIS_MUX('B',20,6) /* PTB_20 */
#define PTB21 KINETIS_MUX('B',21,1) /* PTB_21 */
#define SPI2_SCK_PTB21 KINETIS_MUX('B',21,2) /* PTB_21 */
#define CMP1_OUT_PTB21 KINETIS_MUX('B',21,6) /* PTB_21 */
#define PTB22 KINETIS_MUX('B',22,1) /* PTB_22 */
#define SPI2_SOUT_PTB22 KINETIS_MUX('B',22,2) /* PTB_22 */
#define CMP2_OUT_PTB22 KINETIS_MUX('B',22,6) /* PTB_22 */
#define PTB23 KINETIS_MUX('B',23,1) /* PTB_23 */
#define SPI2_SIN_PTB23 KINETIS_MUX('B',23,2) /* PTB_23 */
#define SPI0_PCS5_PTB23 KINETIS_MUX('B',23,3) /* PTB_23 */
#define ADC0_SE14_PTC0 KINETIS_MUX('C',0,0) /* PTC_0 */
#define PTC0 KINETIS_MUX('C',0,1) /* PTC_0 */
#define SPI0_PCS4_PTC0 KINETIS_MUX('C',0,2) /* PTC_0 */
#define PDB0_EXTRG_PTC0 KINETIS_MUX('C',0,3) /* PTC_0 */
#define USB_SOF_OUT_PTC0 KINETIS_MUX('C',0,4) /* PTC_0 */
#define I2S0_TXD1_PTC0 KINETIS_MUX('C',0,6) /* PTC_0 */
#define ADC0_SE15_PTC1 KINETIS_MUX('C',1,0) /* PTC_1 */
#define LLWU_P6_PTC1 KINETIS_MUX('C',1,1) /* PTC_1 */
#define PTC1 KINETIS_MUX('C',1,1) /* PTC_1 */
#define SPI0_PCS3_PTC1 KINETIS_MUX('C',1,2) /* PTC_1 */
#define UART1_RTS_b_PTC1 KINETIS_MUX('C',1,3) /* PTC_1 */
#define FTM0_CH0_PTC1 KINETIS_MUX('C',1,4) /* PTC_1 */
#define I2S0_TXD0_PTC1 KINETIS_MUX('C',1,6) /* PTC_1 */
#define ADC0_SE4b_PTC2 KINETIS_MUX('C',2,0) /* PTC_2 */
#define CMP1_IN0_PTC2 KINETIS_MUX('C',2,0) /* PTC_2 */
#define PTC2 KINETIS_MUX('C',2,1) /* PTC_2 */
#define SPI0_PCS2_PTC2 KINETIS_MUX('C',2,2) /* PTC_2 */
#define UART1_CTS_b_PTC2 KINETIS_MUX('C',2,3) /* PTC_2 */
#define FTM0_CH1_PTC2 KINETIS_MUX('C',2,4) /* PTC_2 */
#define I2S0_TX_FS_PTC2 KINETIS_MUX('C',2,6) /* PTC_2 */
#define CMP1_IN1_PTC3 KINETIS_MUX('C',3,0) /* PTC_3 */
#define PTC3 KINETIS_MUX('C',3,1) /* PTC_3 */
#define LLWU_P7_PTC3 KINETIS_MUX('C',3,1) /* PTC_3 */
#define SPI0_PCS1_PTC3 KINETIS_MUX('C',3,2) /* PTC_3 */
#define UART1_RX_PTC3 KINETIS_MUX('C',3,3) /* PTC_3 */
#define FTM0_CH2_PTC3 KINETIS_MUX('C',3,4) /* PTC_3 */
#define CLKOUT_PTC3 KINETIS_MUX('C',3,5) /* PTC_3 */
#define I2S0_TX_BCLK_PTC3 KINETIS_MUX('C',3,6) /* PTC_3 */
#define PTC4 KINETIS_MUX('C',4,1) /* PTC_4 */
#define LLWU_P8_PTC4 KINETIS_MUX('C',4,1) /* PTC_4 */
#define SPI0_PCS0_PTC4 KINETIS_MUX('C',4,2) /* PTC_4 */
#define UART1_TX_PTC4 KINETIS_MUX('C',4,3) /* PTC_4 */
#define FTM0_CH3_PTC4 KINETIS_MUX('C',4,4) /* PTC_4 */
#define CMP1_OUT_PTC4 KINETIS_MUX('C',4,6) /* PTC_4 */
#define LLWU_P9_PTC5 KINETIS_MUX('C',5,1) /* PTC_5 */
#define PTC5 KINETIS_MUX('C',5,1) /* PTC_5 */
#define SPI0_SCK_PTC5 KINETIS_MUX('C',5,2) /* PTC_5 */
#define LPTMR0_ALT2_PTC5 KINETIS_MUX('C',5,3) /* PTC_5 */
#define I2S0_RXD0_PTC5 KINETIS_MUX('C',5,4) /* PTC_5 */
#define CMP0_OUT_PTC5 KINETIS_MUX('C',5,6) /* PTC_5 */
#define FTM0_CH2_PTC5 KINETIS_MUX('C',5,7) /* PTC_5 */
#define CMP0_IN0_PTC6 KINETIS_MUX('C',6,0) /* PTC_6 */
#define PTC6 KINETIS_MUX('C',6,1) /* PTC_6 */
#define LLWU_P10_PTC6 KINETIS_MUX('C',6,1) /* PTC_6 */
#define SPI0_SOUT_PTC6 KINETIS_MUX('C',6,2) /* PTC_6 */
#define PDB0_EXTRG_PTC6 KINETIS_MUX('C',6,3) /* PTC_6 */
#define I2S0_RX_BCLK_PTC6 KINETIS_MUX('C',6,4) /* PTC_6 */
#define I2S0_MCLK_PTC6 KINETIS_MUX('C',6,6) /* PTC_6 */
#define CMP0_IN1_PTC7 KINETIS_MUX('C',7,0) /* PTC_7 */
#define PTC7 KINETIS_MUX('C',7,1) /* PTC_7 */
#define SPI0_SIN_PTC7 KINETIS_MUX('C',7,2) /* PTC_7 */
#define USB_SOF_OUT_PTC7 KINETIS_MUX('C',7,3) /* PTC_7 */
#define I2S0_RX_FS_PTC7 KINETIS_MUX('C',7,4) /* PTC_7 */
#define ADC1_SE4b_PTC8 KINETIS_MUX('C',8,0) /* PTC_8 */
#define CMP0_IN2_PTC8 KINETIS_MUX('C',8,0) /* PTC_8 */
#define PTC8 KINETIS_MUX('C',8,1) /* PTC_8 */
#define FTM3_CH4_PTC8 KINETIS_MUX('C',8,3) /* PTC_8 */
#define I2S0_MCLK_PTC8 KINETIS_MUX('C',8,4) /* PTC_8 */
#define ADC1_SE5b_PTC9 KINETIS_MUX('C',9,0) /* PTC_9 */
#define CMP0_IN3_PTC9 KINETIS_MUX('C',9,0) /* PTC_9 */
#define PTC9 KINETIS_MUX('C',9,1) /* PTC_9 */
#define FTM3_CH5_PTC9 KINETIS_MUX('C',9,3) /* PTC_9 */
#define I2S0_RX_BCLK_PTC9 KINETIS_MUX('C',9,4) /* PTC_9 */
#define FTM2_FLT0_PTC9 KINETIS_MUX('C',9,6) /* PTC_9 */
#define ADC1_SE6b_PTC10 KINETIS_MUX('C',10,0) /* PTC_10 */
#define PTC10 KINETIS_MUX('C',10,1) /* PTC_10 */
#define I2C1_SCL_PTC10 KINETIS_MUX('C',10,2) /* PTC_10 */
#define FTM3_CH6_PTC10 KINETIS_MUX('C',10,3) /* PTC_10 */
#define I2S0_RX_FS_PTC10 KINETIS_MUX('C',10,4) /* PTC_10 */
#define ADC1_SE7b_PTC11 KINETIS_MUX('C',11,0) /* PTC_11 */
#define LLWU_P11_PTC11 KINETIS_MUX('C',11,1) /* PTC_11 */
#define PTC11 KINETIS_MUX('C',11,1) /* PTC_11 */
#define I2C1_SDA_PTC11 KINETIS_MUX('C',11,2) /* PTC_11 */
#define FTM3_CH7_PTC11 KINETIS_MUX('C',11,3) /* PTC_11 */
#define I2S0_RXD1_PTC11 KINETIS_MUX('C',11,4) /* PTC_11 */
#define PTC12 KINETIS_MUX('C',12,1) /* PTC_12 */
#define UART4_RTS_b_PTC12 KINETIS_MUX('C',12,3) /* PTC_12 */
#define FTM3_FLT0_PTC12 KINETIS_MUX('C',12,6) /* PTC_12 */
#define PTC13 KINETIS_MUX('C',13,1) /* PTC_13 */
#define UART4_CTS_b_PTC13 KINETIS_MUX('C',13,3) /* PTC_13 */
#define PTC14 KINETIS_MUX('C',14,1) /* PTC_14 */
#define UART4_RX_PTC14 KINETIS_MUX('C',14,3) /* PTC_14 */
#define PTC15 KINETIS_MUX('C',15,1) /* PTC_15 */
#define UART4_TX_PTC15 KINETIS_MUX('C',15,3) /* PTC_15 */
#define PTC16 KINETIS_MUX('C',16,1) /* PTC_16 */
#define UART3_RX_PTC16 KINETIS_MUX('C',16,3) /* PTC_16 */
#define ENET0_1588_TMR0_PTC16 KINETIS_MUX('C',16,4) /* PTC_16 */
#define PTC17 KINETIS_MUX('C',17,1) /* PTC_17 */
#define UART3_TX_PTC17 KINETIS_MUX('C',17,3) /* PTC_17 */
#define ENET0_1588_TMR1_PTC17 KINETIS_MUX('C',17,4) /* PTC_17 */
#define PTC18 KINETIS_MUX('C',18,1) /* PTC_18 */
#define UART3_RTS_b_PTC18 KINETIS_MUX('C',18,3) /* PTC_18 */
#define ENET0_1588_TMR2_PTC18 KINETIS_MUX('C',18,4) /* PTC_18 */
#define PTC19 KINETIS_MUX('C',19,1) /* PTC_19 */
#define UART3_CTS_b_PTC19 KINETIS_MUX('C',19,3) /* PTC_19 */
#define ENET0_1588_TMR3_PTC19 KINETIS_MUX('C',19,4) /* PTC_19 */
#define PTD0 KINETIS_MUX('D',0,1) /* PTD_0 */
#define LLWU_P12_PTD0 KINETIS_MUX('D',0,1) /* PTD_0 */
#define SPI0_PCS0_PTD0 KINETIS_MUX('D',0,2) /* PTD_0 */
#define UART2_RTS_b_PTD0 KINETIS_MUX('D',0,3) /* PTD_0 */
#define FTM3_CH0_PTD0 KINETIS_MUX('D',0,4) /* PTD_0 */
#define ADC0_SE5b_PTD1 KINETIS_MUX('D',1,0) /* PTD_1 */
#define PTD1 KINETIS_MUX('D',1,1) /* PTD_1 */
#define SPI0_SCK_PTD1 KINETIS_MUX('D',1,2) /* PTD_1 */
#define UART2_CTS_b_PTD1 KINETIS_MUX('D',1,3) /* PTD_1 */
#define FTM3_CH1_PTD1 KINETIS_MUX('D',1,4) /* PTD_1 */
#define LLWU_P13_PTD2 KINETIS_MUX('D',2,1) /* PTD_2 */
#define PTD2 KINETIS_MUX('D',2,1) /* PTD_2 */
#define SPI0_SOUT_PTD2 KINETIS_MUX('D',2,2) /* PTD_2 */
#define UART2_RX_PTD2 KINETIS_MUX('D',2,3) /* PTD_2 */
#define FTM3_CH2_PTD2 KINETIS_MUX('D',2,4) /* PTD_2 */
#define I2C0_SCL_PTD2 KINETIS_MUX('D',2,7) /* PTD_2 */
#define PTD3 KINETIS_MUX('D',3,1) /* PTD_3 */
#define SPI0_SIN_PTD3 KINETIS_MUX('D',3,2) /* PTD_3 */
#define UART2_TX_PTD3 KINETIS_MUX('D',3,3) /* PTD_3 */
#define FTM3_CH3_PTD3 KINETIS_MUX('D',3,4) /* PTD_3 */
#define I2C0_SDA_PTD3 KINETIS_MUX('D',3,7) /* PTD_3 */
#define LLWU_P14_PTD4 KINETIS_MUX('D',4,1) /* PTD_4 */
#define PTD4 KINETIS_MUX('D',4,1) /* PTD_4 */
#define SPI0_PCS1_PTD4 KINETIS_MUX('D',4,2) /* PTD_4 */
#define UART0_RTS_b_PTD4 KINETIS_MUX('D',4,3) /* PTD_4 */
#define FTM0_CH4_PTD4 KINETIS_MUX('D',4,4) /* PTD_4 */
#define EWM_IN_PTD4 KINETIS_MUX('D',4,6) /* PTD_4 */
#define SPI1_PCS0_PTD4 KINETIS_MUX('D',4,7) /* PTD_4 */
#define ADC0_SE6b_PTD5 KINETIS_MUX('D',5,0) /* PTD_5 */
#define PTD5 KINETIS_MUX('D',5,1) /* PTD_5 */
#define SPI0_PCS2_PTD5 KINETIS_MUX('D',5,2) /* PTD_5 */
#define UART0_COL_b_PTD5 KINETIS_MUX('D',5,3) /* PTD_5 */
#define UART0_CTS_b_PTD5 KINETIS_MUX('D',5,3) /* PTD_5 */
#define FTM0_CH5_PTD5 KINETIS_MUX('D',5,4) /* PTD_5 */
#define EWM_OUT_b_PTD5 KINETIS_MUX('D',5,6) /* PTD_5 */
#define SPI1_SCK_PTD5 KINETIS_MUX('D',5,7) /* PTD_5 */
#define ADC0_SE7b_PTD6 KINETIS_MUX('D',6,0) /* PTD_6 */
#define PTD6 KINETIS_MUX('D',6,1) /* PTD_6 */
#define LLWU_P15_PTD6 KINETIS_MUX('D',6,1) /* PTD_6 */
#define SPI0_PCS3_PTD6 KINETIS_MUX('D',6,2) /* PTD_6 */
#define UART0_RX_PTD6 KINETIS_MUX('D',6,3) /* PTD_6 */
#define FTM0_CH6_PTD6 KINETIS_MUX('D',6,4) /* PTD_6 */
#define FTM0_FLT0_PTD6 KINETIS_MUX('D',6,6) /* PTD_6 */
#define SPI1_SOUT_PTD6 KINETIS_MUX('D',6,7) /* PTD_6 */
#define PTD7 KINETIS_MUX('D',7,1) /* PTD_7 */
#define CMT_IRO_PTD7 KINETIS_MUX('D',7,2) /* PTD_7 */
#define UART0_TX_PTD7 KINETIS_MUX('D',7,3) /* PTD_7 */
#define FTM0_CH7_PTD7 KINETIS_MUX('D',7,4) /* PTD_7 */
#define FTM0_FLT1_PTD7 KINETIS_MUX('D',7,6) /* PTD_7 */
#define SPI1_SIN_PTD7 KINETIS_MUX('D',7,7) /* PTD_7 */
#define PTD8 KINETIS_MUX('D',8,1) /* PTD_8 */
#define I2C0_SCL_PTD8 KINETIS_MUX('D',8,2) /* PTD_8 */
#define UART5_RX_PTD8 KINETIS_MUX('D',8,3) /* PTD_8 */
#define PTD9 KINETIS_MUX('D',9,1) /* PTD_9 */
#define I2C0_SDA_PTD9 KINETIS_MUX('D',9,2) /* PTD_9 */
#define UART5_TX_PTD9 KINETIS_MUX('D',9,3) /* PTD_9 */
#define PTD10 KINETIS_MUX('D',10,1) /* PTD_10 */
#define UART5_RTS_b_PTD10 KINETIS_MUX('D',10,3) /* PTD_10 */
#define PTD11 KINETIS_MUX('D',11,1) /* PTD_11 */
#define SPI2_PCS0_PTD11 KINETIS_MUX('D',11,2) /* PTD_11 */
#define UART5_CTS_b_PTD11 KINETIS_MUX('D',11,3) /* PTD_11 */
#define SDHC0_CLKIN_PTD11 KINETIS_MUX('D',11,4) /* PTD_11 */
#define PTD12 KINETIS_MUX('D',12,1) /* PTD_12 */
#define SPI2_SCK_PTD12 KINETIS_MUX('D',12,2) /* PTD_12 */
#define FTM3_FLT0_PTD12 KINETIS_MUX('D',12,3) /* PTD_12 */
#define SDHC0_D4_PTD12 KINETIS_MUX('D',12,4) /* PTD_12 */
#define PTD13 KINETIS_MUX('D',13,1) /* PTD_13 */
#define SPI2_SOUT_PTD13 KINETIS_MUX('D',13,2) /* PTD_13 */
#define SDHC0_D5_PTD13 KINETIS_MUX('D',13,4) /* PTD_13 */
#define PTD14 KINETIS_MUX('D',14,1) /* PTD_14 */
#define SPI2_SIN_PTD14 KINETIS_MUX('D',14,2) /* PTD_14 */
#define SDHC0_D6_PTD14 KINETIS_MUX('D',14,4) /* PTD_14 */
#define PTD15 KINETIS_MUX('D',15,1) /* PTD_15 */
#define SPI2_PCS1_PTD15 KINETIS_MUX('D',15,2) /* PTD_15 */
#define SDHC0_D7_PTD15 KINETIS_MUX('D',15,4) /* PTD_15 */
#define ADC1_SE4a_PTE0 KINETIS_MUX('E',0,0) /* PTE_0 */
#define PTE0 KINETIS_MUX('E',0,1) /* PTE_0 */
#define SPI1_PCS1_PTE0 KINETIS_MUX('E',0,2) /* PTE_0 */
#define UART1_TX_PTE0 KINETIS_MUX('E',0,3) /* PTE_0 */
#define SDHC0_D1_PTE0 KINETIS_MUX('E',0,4) /* PTE_0 */
#define TRACE_CLKOUT_PTE0 KINETIS_MUX('E',0,5) /* PTE_0 */
#define I2C1_SDA_PTE0 KINETIS_MUX('E',0,6) /* PTE_0 */
#define RTC_CLKOUT_PTE0 KINETIS_MUX('E',0,7) /* PTE_0 */
#define ADC1_SE5a_PTE1 KINETIS_MUX('E',1,0) /* PTE_1 */
#define LLWU_P0_PTE1 KINETIS_MUX('E',1,1) /* PTE_1 */
#define PTE1 KINETIS_MUX('E',1,1) /* PTE_1 */
#define SPI1_SOUT_PTE1 KINETIS_MUX('E',1,2) /* PTE_1 */
#define UART1_RX_PTE1 KINETIS_MUX('E',1,3) /* PTE_1 */
#define SDHC0_D0_PTE1 KINETIS_MUX('E',1,4) /* PTE_1 */
#define TRACE_D3_PTE1 KINETIS_MUX('E',1,5) /* PTE_1 */
#define I2C1_SCL_PTE1 KINETIS_MUX('E',1,6) /* PTE_1 */
#define SPI1_SIN_PTE1 KINETIS_MUX('E',1,7) /* PTE_1 */
#define ADC1_SE6a_PTE2 KINETIS_MUX('E',2,0) /* PTE_2 */
#define ADC0_DP2_PTE2 KINETIS_MUX('E',2,0) /* PTE_2 */
#define LLWU_P1_PTE2 KINETIS_MUX('E',2,1) /* PTE_2 */
#define PTE2 KINETIS_MUX('E',2,1) /* PTE_2 */
#define SPI1_SCK_PTE2 KINETIS_MUX('E',2,2) /* PTE_2 */
#define UART1_CTS_b_PTE2 KINETIS_MUX('E',2,3) /* PTE_2 */
#define SDHC0_DCLK_PTE2 KINETIS_MUX('E',2,4) /* PTE_2 */
#define TRACE_D2_PTE2 KINETIS_MUX('E',2,5) /* PTE_2 */
#define ADC0_DM2_PTE3 KINETIS_MUX('E',3,0) /* PTE_3 */
#define ADC1_SE7a_PTE3 KINETIS_MUX('E',3,0) /* PTE_3 */
#define PTE3 KINETIS_MUX('E',3,1) /* PTE_3 */
#define SPI1_SIN_PTE3 KINETIS_MUX('E',3,2) /* PTE_3 */
#define UART1_RTS_b_PTE3 KINETIS_MUX('E',3,3) /* PTE_3 */
#define SDHC0_CMD_PTE3 KINETIS_MUX('E',3,4) /* PTE_3 */
#define TRACE_D1_PTE3 KINETIS_MUX('E',3,5) /* PTE_3 */
#define SPI1_SOUT_PTE3 KINETIS_MUX('E',3,7) /* PTE_3 */
#define PTE4 KINETIS_MUX('E',4,1) /* PTE_4 */
#define LLWU_P2_PTE4 KINETIS_MUX('E',4,1) /* PTE_4 */
#define SPI1_PCS0_PTE4 KINETIS_MUX('E',4,2) /* PTE_4 */
#define UART3_TX_PTE4 KINETIS_MUX('E',4,3) /* PTE_4 */
#define SDHC0_D3_PTE4 KINETIS_MUX('E',4,4) /* PTE_4 */
#define TRACE_D0_PTE4 KINETIS_MUX('E',4,5) /* PTE_4 */
#define PTE5 KINETIS_MUX('E',5,1) /* PTE_5 */
#define SPI1_PCS2_PTE5 KINETIS_MUX('E',5,2) /* PTE_5 */
