zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/k6x/pinctrl/MK64FX512VLQ12-pinctrl.h
#define UART3_RX_PTE5 KINETIS_MUX('E',5,3) /* PTE_5 */
#define SDHC0_D2_PTE5 KINETIS_MUX('E',5,4) /* PTE_5 */
#define FTM3_CH0_PTE5 KINETIS_MUX('E',5,6) /* PTE_5 */
#define PTE6 KINETIS_MUX('E',6,1) /* PTE_6 */
#define SPI1_PCS3_PTE6 KINETIS_MUX('E',6,2) /* PTE_6 */
#define UART3_CTS_b_PTE6 KINETIS_MUX('E',6,3) /* PTE_6 */
#define I2S0_MCLK_PTE6 KINETIS_MUX('E',6,4) /* PTE_6 */
#define FTM3_CH1_PTE6 KINETIS_MUX('E',6,6) /* PTE_6 */
#define USB_SOF_OUT_PTE6 KINETIS_MUX('E',6,7) /* PTE_6 */
#define PTE7 KINETIS_MUX('E',7,1) /* PTE_7 */
#define UART3_RTS_b_PTE7 KINETIS_MUX('E',7,3) /* PTE_7 */
#define I2S0_RXD0_PTE7 KINETIS_MUX('E',7,4) /* PTE_7 */
#define FTM3_CH2_PTE7 KINETIS_MUX('E',7,6) /* PTE_7 */
#define PTE8 KINETIS_MUX('E',8,1) /* PTE_8 */
#define I2S0_RXD1_PTE8 KINETIS_MUX('E',8,2) /* PTE_8 */
#define UART5_TX_PTE8 KINETIS_MUX('E',8,3) /* PTE_8 */
#define I2S0_RX_FS_PTE8 KINETIS_MUX('E',8,4) /* PTE_8 */
#define FTM3_CH3_PTE8 KINETIS_MUX('E',8,6) /* PTE_8 */
#define PTE9 KINETIS_MUX('E',9,1) /* PTE_9 */
#define I2S0_TXD1_PTE9 KINETIS_MUX('E',9,2) /* PTE_9 */
#define UART5_RX_PTE9 KINETIS_MUX('E',9,3) /* PTE_9 */
#define I2S0_RX_BCLK_PTE9 KINETIS_MUX('E',9,4) /* PTE_9 */
#define FTM3_CH4_PTE9 KINETIS_MUX('E',9,6) /* PTE_9 */
#define PTE10 KINETIS_MUX('E',10,1) /* PTE_10 */
#define UART5_CTS_b_PTE10 KINETIS_MUX('E',10,3) /* PTE_10 */
#define I2S0_TXD0_PTE10 KINETIS_MUX('E',10,4) /* PTE_10 */
#define FTM3_CH5_PTE10 KINETIS_MUX('E',10,6) /* PTE_10 */
#define PTE11 KINETIS_MUX('E',11,1) /* PTE_11 */
#define UART5_RTS_b_PTE11 KINETIS_MUX('E',11,3) /* PTE_11 */
#define I2S0_TX_FS_PTE11 KINETIS_MUX('E',11,4) /* PTE_11 */
#define FTM3_CH6_PTE11 KINETIS_MUX('E',11,6) /* PTE_11 */
#define PTE12 KINETIS_MUX('E',12,1) /* PTE_12 */
#define I2S0_TX_BCLK_PTE12 KINETIS_MUX('E',12,4) /* PTE_12 */
#define FTM3_CH7_PTE12 KINETIS_MUX('E',12,6) /* PTE_12 */
#define ADC0_SE17_PTE24 KINETIS_MUX('E',24,0) /* PTE_24 */
#define PTE24 KINETIS_MUX('E',24,1) /* PTE_24 */
#define UART4_TX_PTE24 KINETIS_MUX('E',24,3) /* PTE_24 */
#define I2C0_SCL_PTE24 KINETIS_MUX('E',24,5) /* PTE_24 */
#define EWM_OUT_b_PTE24 KINETIS_MUX('E',24,6) /* PTE_24 */
#define ADC0_SE18_PTE25 KINETIS_MUX('E',25,0) /* PTE_25 */
#define PTE25 KINETIS_MUX('E',25,1) /* PTE_25 */
#define UART4_RX_PTE25 KINETIS_MUX('E',25,3) /* PTE_25 */
#define I2C0_SDA_PTE25 KINETIS_MUX('E',25,5) /* PTE_25 */
#define EWM_IN_PTE25 KINETIS_MUX('E',25,6) /* PTE_25 */
#define PTE26 KINETIS_MUX('E',26,1) /* PTE_26 */
#define ENET_1588_CLKIN_PTE26 KINETIS_MUX('E',26,2) /* PTE_26 */
#define UART4_CTS_b_PTE26 KINETIS_MUX('E',26,3) /* PTE_26 */
#define RTC_CLKOUT_PTE26 KINETIS_MUX('E',26,6) /* PTE_26 */
#define USB_CLKIN_PTE26 KINETIS_MUX('E',26,7) /* PTE_26 */
#define PTE27 KINETIS_MUX('E',27,1) /* PTE_27 */
#define UART4_RTS_b_PTE27 KINETIS_MUX('E',27,3) /* PTE_27 */
#define PTE28 KINETIS_MUX('E',28,1) /* PTE_28 */
#endif
